Revit 2026 API

# KeyBasedTreeEntryParentKey Property

---

The parent key of this entry.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string ParentKey { get; }
```
```vb
Public ReadOnly Property ParentKey As String
	Get
```
```cpp
public:
property String^ ParentKey {
	String^ get ();
}
```
```fsharp
member ParentKey : string with get
```

#### Property Value

String

This value will be the empty string if this entry does not have a parent.

#### Reference

KeyBasedTreeEntry Class

Autodesk.Revit.DB Namespace